Revit 2027 API
ScheduleField.HorizontalAlignment Property
 The horizontal alignment of the column's data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleHorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As ScheduleHorizontalAlignment
	Get
	Set
public:
property ScheduleHorizontalAlignment HorizontalAlignment {
	ScheduleHorizontalAlignment get ();
	void set (ScheduleHorizontalAlignment value);
}
member HorizontalAlignment : ScheduleHorizontalAlignment with get, set
Property Value
ScheduleHorizontalAlignment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace